#include "type.h"
#include "stdio.h"
#include "const.h"
#include "protect.h"
#include "string.h"
#include "fs.h"
#include "proc.h"
#include "tty.h"
#include "console.h"
#include "global.h"
#include "proto.h"
/*
char map2[6][6] = {
				 {'#','#','#','#','#','#'},
				 {'#','O','#',' ',' ',' '},
				 {'#',' ','#','#',' ','#'},
				 {'#',' ',' ','#',' ','#'},
				 {'#','#',' ',' ',' ','#'},
				 {'#','#','#','#','#','#'}
};*/
char map2[23][25]={
			{'#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
			{'#','O',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ','#'},
			{'#',' ','#','#','#','#','#','#','#',' ','#',' ','#',' ','#',' ','#',' ','#','#','#',' ','#',' ','#'},
			{'#',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ','#',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ','#'},
			{'#','#','#','#','#',' ','#','#','#','#','#',' ','#',' ','#','#','#','#','#','#','#','#','#',' ','#'},
			{'#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ','#'},
			{'#',' ','#','#','#','#','#',' ','#',' ','#','#','#','#',' ','#','#','#',' ','#','#',' ','#','#','#'},
			{'#',' ',' ',' ',' ',' ','#',' ','#',' ','#','#',' ',' ',' ','#','#',' ','#',' ','#',' ',' ',' ','#'},
			{'#',' ','#','#','#','#','#',' ','#',' ','#','#',' ','#','#','#','#',' ','#',' ','#','#','#',' ','#'},
			{'#',' ',' ',' ',' ',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ','#'},
			{'#','#','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#','#','#',' ','#',' ','#','#','#'},
			{'#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ','#',' ','#'},
			{'#',' ','#','#','#',' ','#','#','#','#','#','#','#',' ','#',' ','#',' ','#',' ','#','#','#',' ','#'},
			{'#',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ','#',' ','#',' ',' ',' ',' ',' ','#'},
			{'#',' ','#','#','#','#','#',' ','#',' ','#','#','#','#','#',' ','#','#','#','#','#','#','#',' ','#'},
			{'#',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ','#',' ','#'},
			{'#',' ','#','#','#','#','#','#','#','#','#','#','#','#','#',' ','#','#','#','#','#',' ','#',' ','#'},
			{'#',' ','#',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ','#',' ','#',' ',' ',' ',' ',' ','#',' ','#'},
			{'#',' ','#','#','#',' ','#',' ','#','#','#',' ','#',' ','#','#','#',' ','#','#','#',' ',' ',' ','#'},
			{'#',' ','#',' ',' ',' ','#',' ','#',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ','#',' ','#'},
			{'#',' ','#',' ','#','#','#',' ','#',' ','#','#','#',' ','#','#','#','#','#','#','#','#','#',' ','#'},
			{'#',' ',' ',' ',' ',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' '},
			{'#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
};
int currentX = 1;
int currentY = 1;
char street = ' ';
char buf2[10] = { 0 };
void migong(int fd_stdin,int fd_stdout) {
	printf("Welcome to migong Game!\n\n\n");
   	printf("LEFT: a    RIGHT: d\n");
   	printf("UP:   w    DOWN:  s\n");
    	printf("EXIT: press enter  \n\n\n");
		 //   打印地图
		     for (int i = 0; i < 23; i++) {
		        for (int j = 0; j < 25; j++) {
			             printf("%c", map2[i][j]);
				}
		         printf("\n");
			 }
		     while (read(fd_stdin,buf2,1)){
				 switch (buf2[0]) {
				 case  'q':{
				 	printf("Quit the Maze Game!");
				 	return;
				 }
				 case  'w': {
				 	 clear();
					 int nextX = currentX - 1;
					 if (map2[nextX][currentY] == street) {
						 //               交换位置
						 char temp = map2[currentX][currentY];
						 map2[currentX][currentY] = map2[nextX][currentY];
						 map2[nextX][currentY] = temp;
						 //              改变小人当前位置
						 currentX = nextX;
					 }
					 break;
				 }
				 case 's': {
					 //          如果小人下一个位置是路就移动小人
					 clear();
					 int nextX = currentX + 1;
					 if (map2[nextX][currentY] == street) {
						 //               定义中间变量记录小人的当前位置
						 //               交换位置
						 char temp = map2[currentX][currentY];
						 map2[currentX][currentY] = map2[nextX][currentY];
						 map2[nextX][currentY] = temp;
						 //              改变小人当前位置
						 currentX = nextX;
					 }
					 break;
				 }
				 case 'a': {
				 	clear();
					 //          计算小人下一个位置
					 int nextY = currentY - 1;
					 if (map2[currentX][nextY] == street) {
						 //                交换位置
						 char temp = map2[currentX][currentY];
						 map2[currentX][currentY] = map2[currentX][nextY];
						 map2[currentX][nextY] = temp;
						 //               改变小人当前位置
						 currentY = nextY;
					 }
					 break;
				 }
				 case 'd':{
				 clear();
					 int nextY = currentY + 1;
					 if (map2[currentX][nextY] == street) {
						 //交换位置
						 char temp = map2[currentX][currentY];
						 map2[currentX][currentY] = map2[currentX][nextY];
						 map2[currentX][nextY] = temp;
						 //改变小人当前位置
						 currentY = nextY;
					 }
					 break;
				 }
			 }
		
			
			         //   打印地图
			         for (int i = 0; i < 23; i++) {
			
				             for (int j = 0; j < 25; j++) {
				                 printf("%c", map2[i][j]);
				
			}
			             printf("\n");
			
		}
					 if (currentX == 21 && currentY == 24){
						 printf("you win\n");
			             break;
			         }
	}
}
